ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_adc_global_regs.xml
<module id="ADC_GLOBAL_REGS" HW_revision="" description="ADC GLOBAL Registers">
	<register id="ADCSOCFRCGB" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="ADC Global SOC Force">
		<bitfield id="SOC0" description="Generate synchronous SW trigger for SOC0" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SOC1" description="Generate synchronous SW trigger for SOC1" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SOC2" description="Generate synchronous SW trigger for SOC2" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SOC3" description="Generate synchronous SW trigger for SOC3" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SOC4" description="Generate synchronous SW trigger for SOC4" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SOC5" description="Generate synchronous SW trigger for SOC5" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SOC6" description="Generate synchronous SW trigger for SOC6" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SOC7" description="Generate synchronous SW trigger for SOC7" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SOC8" description="Generate synchronous SW trigger for SOC8" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SOC9" description="Generate synchronous SW trigger for SOC9" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SOC10" description="Generate synchronous SW trigger for SOC10" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SOC11" description="Generate synchronous SW trigger for SOC11" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SOC12" description="Generate synchronous SW trigger for SOC12" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SOC13" description="Generate synchronous SW trigger for SOC13" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="SOC14" description="Generate synchronous SW trigger for SOC14" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="SOC15" description="Generate synchronous SW trigger for SOC15" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="SOC16" description="Generate synchronous SW trigger for SOC16" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SOC17" description="Generate synchronous SW trigger for SOC17" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="SOC18" description="Generate synchronous SW trigger for SOC18" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="SOC19" description="Generate synchronous SW trigger for SOC19" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SOC20" description="Generate synchronous SW trigger for SOC20" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="SOC21" description="Generate synchronous SW trigger for SOC21" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="SOC22" description="Generate synchronous SW trigger for SOC22" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="SOC23" description="Generate synchronous SW trigger for SOC23" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="SOC24" description="Generate synchronous SW trigger for SOC24" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="SOC25" description="Generate synchronous SW trigger for SOC25" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="SOC26" description="Generate synchronous SW trigger for SOC26" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="SOC27" description="Generate synchronous SW trigger for SOC27" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="SOC28" description="Generate synchronous SW trigger for SOC28" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="SOC29" description="Generate synchronous SW trigger for SOC29" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="SOC30" description="Generate synchronous SW trigger for SOC30" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="SOC31" description="Generate synchronous SW trigger for SOC31" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCSOCFRCGBSEL" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="ADC Global SOC Force Select">
		<bitfield id="ADCA" description="Generate synchronous SW trigger for ADCA" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADCB" description="Generate synchronous SW trigger for ADCB" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ADCC" description="Generate synchronous SW trigger for ADCC" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ADCD" description="Generate synchronous SW trigger for ADCD" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ADCE" description="Generate synchronous SW trigger for ADCE" begin="4" end="4" width="1" rwaccess="RW"/>
	</register>
	<register id="PARITY_TEST_ALT1" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="Enables parity test">
		<bitfield id="TESTEN" description="Parity test enable configuration" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
</module>
